Documents/АктВозвратаТоваровНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктВозвратаТоваровНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаДоставке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРеализации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ГрузовоеМесто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаДоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаДоставке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВозвращенногоТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктВозвратаТоваровНаСклад/Ext/ObjectModule.bsl
Процедура ИзменитьСтатусЗаданияНаДоставку(СтатусУстановки) Экспорт
	
	СтатусВыполнения = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	СтатусВыполнения.Отбор.Объект.Установить(ЗаданиеНаДоставку);
	СтатусВыполнения.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.СтатусВыполнения);
	
	СтатусВыполнения.Прочитать();
	
	Если СтатусВыполнения.Количество() = 0 Тогда
		
		НовыйСтатусВыполнения = СтатусВыполнения.Добавить();
		НовыйСтатусВыполнения.Объект = ЗаданиеНаДоставку;
		НовыйСтатусВыполнения.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СтатусВыполнения;
		
	Иначе
		НовыйСтатусВыполнения = СтатусВыполнения[0];
	КонецЕсли;
	
	НовыйСтатусВыполнения.Значение = СтатусУстановки;
	СтатусВыполнения.Записать(); 	

КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("Макет", "Акт приема-передачи");
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()


Процедура ДвиженияПоРегистрам()

	// сколько товаров мы ждем от водителя	
	ТаблицаОстатков = РаботаСТоварамиНаДоставке.ТоварыНаДоставке(ЭтотОбъект.Ссылка);	
	
	// сколько товаров он сдал	
	ТаблицаДокумента = ЭтотОбъект.Товары.Выгрузить(,"ДокументРеализации, Номенклатура, КоличествоПлан, КоличествоФакт");
	
	
	// закинем обе таблицы во временные таблицы
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Параметры.Вставить("ТаблицаОстатков", ТаблицаОстатков);
	Запрос.Параметры.Вставить("ТаблицаДокумента", ТаблицаДокумента);
	Запрос.Параметры.Вставить("ЗаданиеНаДоставку", ЭтотОбъект.ЗаданиеНаДоставку);	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОстатков.ЗаданиеНаДоставку,
	               |	ТаблицаОстатков.ДокументРеализации,
	               |	ТаблицаОстатков.Номенклатура,
	               |	ТаблицаОстатков.Количество,
	               |	ТаблицаОстатков.КоличествоВозвращенногоТовара
	               |ПОМЕСТИТЬ ТаблицаОстатков
	               |ИЗ
	               |	&ТаблицаОстатков КАК ТаблицаОстатков";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ЗаданиеНаДоставку,
	               |	ТаблицаДокумента.ДокументРеализации,
	               |	ТаблицаДокумента.Номенклатура,
	               |	ТаблицаДокумента.КоличествоПлан,				   
	               |	ТаблицаДокумента.КоличествоФакт
	               |ПОМЕСТИТЬ ТаблицаДокумента
	               |ИЗ
	               |	&ТаблицаДокумента КАК ТаблицаДокумента";
	Запрос.Выполнить();
	
	
// формируем таблицу движений, специально поместив в неё нулевые количества для корректной печати.
// Потому что нужна совпадающая нумерация строк и в табличной части, и в движениях
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ЗаданиеНаДоставку,
		|	ТаблицаДокумента.ДокументРеализации,
		|	ТаблицаДокумента.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.КоличествоФакт > ЕСТЬNULL(ТаблицаОстатков.Количество, 0)
		|			ТОГДА ЕСТЬNULL(ТаблицаОстатков.Количество, 0)
		|		ИНАЧЕ ТаблицаДокумента.КоличествоФакт
		|	КОНЕЦ КАК Количество,
		|	ТаблицаДокумента.КоличествоФакт - ВЫБОР
		|		КОГДА ТаблицаДокумента.КоличествоФакт > ЕСТЬNULL(ТаблицаОстатков.Количество, 0)
		|			ТОГДА ЕСТЬNULL(ТаблицаОстатков.Количество, 0)
		|		ИНАЧЕ ТаблицаДокумента.КоличествоФакт
		|	КОНЕЦ КАК КоличествоВозвращенногоТовара,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
		|		ПО ТаблицаДокумента.ЗаданиеНаДоставку = ТаблицаОстатков.ЗаданиеНаДоставку
		|			И ТаблицаДокумента.ДокументРеализации = ТаблицаОстатков.ДокументРеализации
		|			И ТаблицаДокумента.Номенклатура = ТаблицаОстатков.Номенклатура";
	
	ТаблицаДляПроведения = Запрос.Выполнить().Выгрузить();
	
	Движения.ТоварыНаДоставке.Записывать = Истина;
	ТаблицаДляПроведения.Колонки.Добавить("Период");
	ТаблицаДляПроведения.ЗаполнитьЗначения(ЭтотОбъект.Дата, "Период");
	Движения.ТоварыНаДоставке.Загрузить(ТаблицаДляПроведения);
	
// Устанавливаем статус в случае, если совпали план-факт

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ЗаданиеНаДоставку,
		|	ТаблицаДокумента.ДокументРеализации,
		|	ТаблицаДокумента.Номенклатура,
		|	СУММА(ТаблицаДокумента.КоличествоПлан - ТаблицаДокумента.КоличествоФакт) КАК Разница
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Номенклатура,
		|	ТаблицаДокумента.ДокументРеализации,
		|	ТаблицаДокумента.ЗаданиеНаДоставку
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТаблицаДокумента.КоличествоПлан - ТаблицаДокумента.КоличествоФакт) = 0";
	
	Если Запрос.Выполнить().Пустой() Тогда
// все ок		
		ИзменитьСтатусЗаданияНаДоставку(Перечисления.СтатусыВыполнения.Выполнено);
	КонецЕсли;		
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДатаВключенияТоваровНаДоставке	=	Константы.ДатаВключенияТоваровНаДоставке.Получить();
	
	Если (НЕ ЗНачениеЗаполнено(ДатаВключенияТоваровНаДоставке))  // пустая константа
		ИЛИ (НачалоДня(ДатаВключенияТоваровНаДоставке) >  ЭтотОбъект.Дата) Тогда   // константа больше даты документа
		//	оставляем движения
			Возврат
	Иначе
		//	все нормально, проводим
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
		ДвиженияПоРегистрам()
	КонецЕсли;
	
	
КонецПроцедуры

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	#Если Клиент Тогда	
	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктВозвратаТоваровНаСклад.Дата,
	               |	АктВозвратаТоваровНаСклад.Номер,
	               |	АктВозвратаТоваровНаСклад.Водитель,
	               |	АктВозвратаТоваровНаСклад.Ответственный
	               |ИЗ
	               |	Документ.АктВозвратаТоваровНаСклад КАК АктВозвратаТоваровНаСклад
	               |ГДЕ
	               |	АктВозвратаТоваровНаСклад.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Товары.Номенклатура,
	               |	Товары.Родитель,
	               |	Товары.Артикул,
	               |	Товары.КодПроизводителя,
	               |	Товары.ГрузовоеМесто,
	               |	СУММА(Товары.Количество) КАК Количество,
	               |	Товары.ТипРазмещения
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварыНаДоставке.Номенклатура КАК Номенклатура,
	               |		ТоварыНаДоставке.Номенклатура.Родитель КАК Родитель,
	               |		ТоварыНаДоставке.Номенклатура.Артикул КАК Артикул,
	               |		ТоварыНаДоставке.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	               |		АктВозвратаТоваровНаСкладТовары.ГрузовоеМесто КАК ГрузовоеМесто,
	               |		СУММА(ВЫБОР
	               |				КОГДА ЕСТЬNULL(ТоварыНаДоставке.Количество, 0) = 0
	               |					ТОГДА ЕСТЬNULL(ТоварыНаДоставке.КоличествоВозвращенногоТовара, 0)
	               |				ИНАЧЕ ЕСТЬNULL(ТоварыНаДоставке.Количество, 0)
	               |			КОНЕЦ) КАК Количество,
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТоварыНаДоставке.Количество, 0) = 0
	               |				ТОГДА ""В ячейку Возврат""
	               |			ИНАЧЕ ""На доставку""
	               |		КОНЕЦ КАК ТипРазмещения
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаДоставке КАК ТоварыНаДоставке
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВозвратаТоваровНаСклад.Товары КАК АктВозвратаТоваровНаСкладТовары
	               |			ПО ТоварыНаДоставке.НомерСтроки = АктВозвратаТоваровНаСкладТовары.НомерСтроки
	               |				И ТоварыНаДоставке.Номенклатура = АктВозвратаТоваровНаСкладТовары.Номенклатура
	               |				И ТоварыНаДоставке.ДокументРеализации = АктВозвратаТоваровНаСкладТовары.ДокументРеализации
	               |	ГДЕ
	               |		ТоварыНаДоставке.Регистратор = &Ссылка
	               |		И АктВозвратаТоваровНаСкладТовары.Ссылка = &Ссылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		АктВозвратаТоваровНаСкладТовары.ГрузовоеМесто,
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТоварыНаДоставке.Количество, 0) = 0
	               |				ТОГДА ""В ячейку Возврат""
	               |			ИНАЧЕ ""На доставку""
	               |		КОНЕЦ,
	               |		ТоварыНаДоставке.Номенклатура,
	               |		ТоварыНаДоставке.Номенклатура.Родитель,
	               |		ТоварыНаДоставке.Номенклатура.Артикул,
	               |		ТоварыНаДоставке.Номенклатура.КодПроизводителя) КАК Товары
	               |ГДЕ
	               |	Товары.Количество > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Товары.ТипРазмещения,
	               |	Товары.ГрузовоеМесто,
	               |	Товары.КодПроизводителя,
	               |	Товары.Артикул,
	               |	Товары.Номенклатура,
	               |	Товары.Родитель
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Пакет = Запрос.ВыполнитьПакет();
	
	ЗапросШапка = Пакет[0].Выгрузить();
	
	Выборка = Пакет[1].Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВозвратаТоваровНаСклад";
	Макет = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	Шапка = ЗапросШапка[0];
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	ОбластьМакета.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
			
	ТабДок.Вывести(ОбластьМакета);

	Счетчик = 1;

	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Счетчик = Счетчик;
		
		Если ЗначениеЗаполнено(Выборка.ГрузовоеМесто) Тогда
			ОбластьМакета.Параметры.ГрузовоеМесто = "Место " + ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ГрузовоеМесто,,, Истина);
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьМакета);
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
				
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДок.Вывести(ОбластьМакета);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ФиксацияСверху = 4;
	ТабДок.ПолеСлева = 1;
	ТабДок.ПолеСправа = 0;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
	#КонецЕсли

КонецПроцедуры
